{"nodes":[{"id":"3","user":"test@example.com","class":"user","content":"lets talk about democracy","noted_by":[]},{"id":"5","user":"test@example.com","class":"answer","content":"Great! Democracy is a form of government where power ultimately lies with the people, either directly or through elected representatives. Key philosophical points about democracy include:\n\n1. **Popular Sovereignty**: The authority of the government is created and sustained by the consent of its people, through their elected representatives.\n\n2. **Equality**: Democracy is founded on the principle of political equality, where each citizen has an equal say in the decisions that affect their lives.\n\n3. **Freedom**: Essential freedoms, such as speech, assembly, and the press, are protected to ensure that citizens can express their opinions and influence government.\n\n4. **Rule of Law**: Laws apply equally to all citizens, and the government itself is subject to the law, preventing arbitrary use of power.\n\n5. **Majority Rule and Minority Rights**: While decisions are made by majority vote, the rights of minorities are protected to prevent the \"tyranny of the majority.\"\n\n6. **Deliberation and Participation**: Democracy thrives on active participation and informed deliberation among citizens, fostering a more engaged and educated populace.\n\nPhilosophers like John Locke, Jean-Jacques Rousseau, and John Stuart Mill have contributed significantly to democratic theory, emphasizing the importance of individual rights, social contract, and the role of public opinion in governance.\n\nWould you like to dive deeper into any specific aspect?","noted_by":[]},{"id":"1","user":"","class":"","content":"bill","noted_by":[]},{"id":"2","user":"test@example.com","class":"user","content":"cdcxPubSubPubSubPubSubWorking!!","noted_by":[]},{"id":"4","user":"test@example.com","class":"answer","content":"","noted_by":[]}],"edges":[{"data":{"id":"35","source":"3","target":"5"}},{"data":{"id":"12","source":"1","target":"2"}},{"data":{"id":"23","source":"2","target":"3"}},{"data":{"id":"34","source":"3","target":"4"}}]}