{
  "nodes": [
    {
      "id": "3",
      "user": null,
      "class": "user",
      "content": "edited node",
      "deleted": false,
      "noted_by": []
    },
    {
      "id": "5",
      "user": null,
      "class": "answer",
      "content": "Thailand is a constitutional monarchy with a democratically elected government. However, the country has experienced periods of military rule and political instability in recent decades. Here are some key points about the political ideology in Thailand:\n\n- Officially, Thailand is a multi-party democracy with regular elections. However, the military has wielded significant influence and power at times.\n\n- Thai politics has elements of Thai nationalism and royalist ideology, with a revered monarchy as the head of state. The monarchy commands great respect and loyalty.\n\n- Historically, there has been a struggle between democratic reformists/activists and entrenched conservative elite interests aligned with the military and monarchy.\n\n- Major political parties and factions have ranged from pro-democracy to nationalist/royalist to military-backed groups. However, the ideological divide is complex.\n\n- Economic pragmatism, rather than rigid ideology, has often taken precedence, with a focus on economic development and prosperity.\n\n- In recent years, there has been a divide between populist movements, such as the former Thai Rak Thai party of Thaksin Shinawatra, and the urban middle class and elite establishment.\n\nSo in summary, while a democracy officially, Thai politics blends elements of democratic values, nationalism, royalism, and military influence amidst a struggle for democratization and reform. Ideological rigidity takes a back seat to",
      "deleted": false,
      "noted_by": []
    },
    {
      "id": "1",
      "user": "",
      "class": "",
      "content": "delete",
      "deleted": false,
      "noted_by": []
    },
    {
      "id": "2",
      "user": null,
      "class": "user",
      "content": "bobbob working?bobbob working? fdsfsd",
      "deleted": false,
      "noted_by": []
    },
    {
      "id": "4",
      "user": null,
      "class": "user",
      "content": "What is the political idealology of Thailand?",
      "deleted": false,
      "noted_by": []
    }
  ],
  "edges": [
    { "data": { "id": "45", "source": "4", "target": "5" } },
    { "data": { "id": "34", "source": "3", "target": "4" } },
    { "data": { "id": "23", "source": "2", "target": "3" } },
    { "data": { "id": "12", "source": "1", "target": "2" } }
  ]
}
