{"nodes":[{"id":"3","user":"test@example.com","class":"answer","content":"\"Small is Beautiful: A Study of Economics as if People Mattered\" by E.F. Schumacher, published in 1973, critiques modern industrial capitalism and advocates for a more sustainable, human-centered approach to economics. Key points include:\n\n1. **Critique of Gigantism**: Schumacher argues that large-scale industrialization and technology often lead to environmental degradation, social alienation, and economic inefficiency. He champions smaller, decentralized systems that are more adaptable and sustainable.\n\n2. **Buddhist Economics**: He introduces the concept of \"Buddhist economics,\" which emphasizes simplicity, non-violence, and the well-being of individuals over material wealth. This approach values meaningful work and sustainable resource","noted_by":null},{"id":"5","user":"test@example.com","class":"answer","content":"Schumacher's idea of **intermediate technology** (also called \"appropriate technology\") focuses on developing tools and systems that are small-scale, affordable, and suited to local conditions. It bridges the gap between traditional, labor-intensive methods and high-tech, capital-intensive industrial systems. The goal is to empower communities, reduce dependency on external resources, and promote sustainable development while preserving human dignity and environmental balance. It’s technology that is \"small enough to understand, cheap enough to be accessible, and simple enough to maintain.\"","noted_by":null},{"id":"1","user":null,"class":null,"content":"Small is Beautiful - Schumacher","noted_by":null},{"id":"2","user":"test@example.com","class":"user","content":"Can you provide a summary of Small is Beautiful by EF Schumacher ","noted_by":null},{"id":"4","user":"test@example.com","class":"user","content":"What was his idea of intermediate technology?","noted_by":null}],"edges":[{"data":{"id":"23","source":"2","target":"3"}},{"data":{"id":"12","source":"1","target":"2"}},{"data":{"id":"45","source":"4","target":"5"}},{"data":{"id":"34","source":"3","target":"4"}}]}